# 1. Mongo Connection

Establecemos la conexión con mongo que a través del enlace del .env que se encuentra en el visual studio code. Con load_dotenv() nos aseguramos que efectivamente existe ese archivo, así que por ahora todo bien.

In [1]:
mongodb+srv://{user}:{password}@cluster0.kf98ps2.mongodb.net/test

SyntaxError: invalid syntax (1193530410.py, line 1)

In [2]:
from pymongo import MongoClient
import os
from dotenv import load_dotenv
load_dotenv()

True

In [3]:
url=os.getenv("url")

In [4]:
client = MongoClient(url)

In [5]:
db = client.get_database("BCN_data")

# 2. Limpieza datos usando pandas

In [6]:
import pandas as pd

## 2.1. Population

#### Cargar los datos
A continuación cargamos los datos de population y comprobamos que podemos acceder correctamente a ellos.

In [11]:
population = db["population"]

In [13]:
df = pd.read_csv("./data/population.csv")

In [14]:
df.head()

,Year,District.Code,District.Name,Neighborhood.Code,Neighborhood.Name,Gender,Age,Number
0,2017,1,Ciutat Vella,1,el Raval,Male,0-4,224
1,2017,1,Ciutat Vella,2,el Barri Gòtic,Male,0-4,50
2,2017,1,Ciutat Vella,3,la Barceloneta,Male,0-4,43
3,2017,1,Ciutat Vella,4,"Sant Pere, Santa Caterina i la Ribera",Male,0-4,95
4,2017,2,Eixample,5,el Fort Pienc,Male,0-4,124

#### Análisis exploratorio
Ahora vemos las características de los datos. En primer lugar, la info de las filas y columnas

In [15]:
df.shape

(70080, 8)

In [17]:
df.dtypes

Year                  int64
District.Code         int64
District.Name        object
Neighborhood.Code     int64
Neighborhood.Name    object
Gender               object
Age                  object
Number                int64
dtype: object

Vemos si hay datos duplicados

In [18]:
df.duplicated().sum()

4277

In [ ]:
#eliminamos los duplicados
#df = df.drop_duplicates()

Vemos si hay datos nulos

In [19]:
df.isna().sum()

Year                 0
District.Code        0
District.Name        0
Neighborhood.Code    0
Neighborhood.Name    0
Gender               0
Age                  0
Number               0
dtype: int64

Vemos los datos de las columnas categóricas, que son las que más nos interesan para el análisis

In [20]:
df.describe(exclude = "number")

       District.Name Neighborhood.Name Gender    Age
count          70080             70080  70080  70080
unique            10                73      2     20
top       Nou Barris          el Raval   Male    0-4
freq           12480               960  35040   3650

In [21]:
df["District.Name"].value_counts()

Nou Barris             12480
Horta-Guinardó         10560
Sant Martí              9600
Sants-Montjuïc          7680
Sant Andreu             6720
Eixample                5760
Sarrià-Sant Gervasi     5760
Gràcia                  4800
Ciutat Vella            3840
Les Corts               2880
Name: District.Name, dtype: int64

In [23]:
df["Neighborhood.Name"].value_counts()

el Raval                                 960
la Teixonera                             960
Torre Baró                               960
la Trinitat Nova                         960
la Prosperitat                           960
                                        ...
Sant Gervasi - la Bonanova               960
les Tres Torres                          960
Sarrià                                   960
Vallvidrera, el Tibidabo i les Planes    960
la Verneda i la Pau                      960
Name: Neighborhood.Name, Length: 73, dtype: int64

In [24]:
df["Gender"].value_counts()

Male      35040
Female    35040
Name: Gender, dtype: int64

In [25]:
df["Age"].value_counts()

0-4      3650
5-9      3650
90-94    3650
85-89    3650
80-84    3650
75-79    3650
70-74    3650
65-69    3650
60-64    3650
55-59    3650
50-54    3650
45-49    3650
40-44    3650
35-39    3650
30-34    3650
25-29    3650
20-24    3650
15-19    3650
10-14    3650
>=95      730
Name: Age, dtype: int64

Vemos también la información de las columnas numéricas, sobre todo para ver los datos de 'year' y 'number'.

-> Como idea, podemos ordenar los datos según la columna 'number' pero no sé si sería muy útil

In [ ]:
df.describe()

In [26]:
df["Year"].value_counts()

2017    14016
2016    14016
2015    14016
2014    14016
2013    14016
Name: Year, dtype: int64

## 2.2. Immigrants

In [28]:
immigrants = db["immigrants"]

In [29]:
df = pd.read_csv("./data/immigrants_by_nationality.csv")

In [30]:
df.head()

,Year,District Code,District Name,Neighborhood Code,Neighborhood Name,Nationality,Number
0,2017,1,Ciutat Vella,1,el Raval,Spain,1109
1,2017,1,Ciutat Vella,2,el Barri Gòtic,Spain,482
2,2017,1,Ciutat Vella,3,la Barceloneta,Spain,414
3,2017,1,Ciutat Vella,4,"Sant Pere, Santa Caterina i la Ribera",Spain,537
4,2017,2,Eixample,5,el Fort Pienc,Spain,663

In [31]:
df.shape

(35224, 7)

In [32]:
df.dtypes

Year                  int64
District Code         int64
District Name        object
Neighborhood Code     int64
Neighborhood Name    object
Nationality          object
Number                int64
dtype: object

In [33]:
df.duplicated().sum()

0

In [34]:
df.isna().sum()

Year                 0
District Code        0
District Name        0
Neighborhood Code    0
Neighborhood Name    0
Nationality          0
Number               0
dtype: int64

In [35]:
df.describe(exclude = "number")

       District Name Neighborhood Name Nationality
count          35224             35224       35224
unique            11                74         177
top       Nou Barris          el Raval       Spain
freq            6188               476         222

Hay un distrito y un barrio más que en los datos de población-> investigar 'No consta'

In [37]:
df["District Name"].value_counts()

Nou Barris             6188
Horta-Guinardó         5236
Sant Martí             4760
Sants-Montjuïc         3808
Sant Andreu            3332
Eixample               2856
Sarrià-Sant Gervasi    2856
Gràcia                 2380
Ciutat Vella           1904
Les Corts              1428
No consta               476
Name: District Name, dtype: int64

In [38]:
df["Neighborhood Name"].value_counts()

el Raval                                 476
Vallbona                                 476
Torre Baró                               476
la Trinitat Nova                         476
la Prosperitat                           476
                                        ...
Sant Gervasi - la Bonanova               476
les Tres Torres                          476
Sarrià                                   476
Vallvidrera, el Tibidabo i les Planes    476
No consta                                476
Name: Neighborhood Name, Length: 74, dtype: int64

In [39]:
df["Nationality"].value_counts()

Spain              222
Macedonia          222
Iceland            222
Libya              222
Thailand           222
                  ...
Chad                74
Solomon Islands     74
Botswana            74
Laos                74
Taiwan              74
Name: Nationality, Length: 177, dtype: int64

In [41]:
df.describe()

               Year  District Code  Neighborhood Code        Number
count  35224.000000   35224.000000       35224.000000  35224.000000
mean    2016.010504       7.500000          37.837838      7.707273
std        0.810846      11.061717          22.119174     50.421883
min     2015.000000       1.000000           1.000000      0.000000
25%     2015.000000       4.000000          19.000000      0.000000
50%     2016.000000       7.000000          37.500000      0.000000
75%     2017.000000       8.000000          56.000000      2.000000
max     2017.000000      99.000000          99.000000   1603.000000

In [40]:
df["Year"].value_counts()

2016    12062
2017    11766
2015    11396
Name: Year, dtype: int64

## 2.3. Unemployment

In [42]:
unemployment = db["unemployment"]

In [46]:
df = pd.read_csv("./data/unemployment.csv")

In [47]:
df.head()

,Year,Month,District Code,District Name,Neighborhood Code,Neighborhood Name,Gender,Demand_occupation,Number
0,2017,January,1,Ciutat Vella,1,el Raval,Male,Registered unemployed,2107
1,2017,January,1,Ciutat Vella,2,el Barri Gòtic,Male,Registered unemployed,538
2,2017,January,1,Ciutat Vella,3,la Barceloneta,Male,Registered unemployed,537
3,2017,January,1,Ciutat Vella,4,"Sant Pere, Santa Caterina i la Ribera",Male,Registered unemployed,741
4,2017,January,2,Eixample,5,el Fort Pienc,Male,Registered unemployed,630

In [48]:
df.shape

(14208, 9)

In [49]:
df.dtypes

Year                  int64
Month                object
District Code         int64
District Name        object
Neighborhood Code     int64
Neighborhood Name    object
Gender               object
Demand_occupation    object
Number                int64
dtype: object

In [51]:
df.duplicated().sum()

0

In [53]:
df.isna().sum()

Year                 0
Month                0
District Code        0
District Name        0
Neighborhood Code    0
Neighborhood Name    0
Gender               0
Demand_occupation    0
Number               0
dtype: int64

In [54]:
df.describe(exclude = "number")

          Month District Name Neighborhood Name Gender      Demand_occupation
count     14208         14208             14208  14208                  14208
unique       12            11                74      2                      2
top     January    Nou Barris          el Raval   Male  Registered unemployed
freq       1184          2496               192   7104                   8880

In [55]:
df["District Name"].value_counts()

Nou Barris             2496
Horta-Guinardó         2112
Sant Martí             1920
Sants-Montjuïc         1536
Sant Andreu            1344
Eixample               1152
Sarrià-Sant Gervasi    1152
Gràcia                  960
Ciutat Vella            768
Les Corts               576
No consta               192
Name: District Name, dtype: int64

In [56]:
df["Neighborhood Name"].value_counts()

el Raval                                 192
Vallbona                                 192
Torre Baró                               192
la Trinitat Nova                         192
la Prosperitat                           192
                                        ...
Sant Gervasi - la Bonanova               192
les Tres Torres                          192
Sarrià                                   192
Vallvidrera, el Tibidabo i les Planes    192
No consta                                192
Name: Neighborhood Name, Length: 74, dtype: int64

In [59]:
df["Demand_occupation"].value_counts()

Registered unemployed    8880
Unemployment demand      5328
Name: Demand_occupation, dtype: int64

In [60]:
df.describe()

               Year  District Code  Neighborhood Code        Number
count  14208.000000   14208.000000       14208.000000  14208.000000
mean    2015.375000       7.500000          37.837838    446.701506
std        1.317003      11.061949          22.119639    425.948449
min     2013.000000       1.000000           1.000000      0.000000
25%     2014.750000       4.000000          19.000000    121.000000
50%     2015.500000       7.000000          37.500000    296.000000
75%     2016.250000       8.000000          56.000000    685.000000
max     2017.000000      99.000000          99.000000   3094.000000

In [61]:
df["Year"].value_counts()

2017    3552
2016    3552
2015    3552
2014    1776
2013    1776
Name: Year, dtype: int64